fix(schema): fixes and key restrictions based on indexer testing
