--- a/docs/learn/beginner/00-app-anatomy.md
+++ b/docs/learn/beginner/00-app-anatomy.md
@@ -12,22 +12,31 @@ This document describes the core parts of a Cosmos SDK application, represented 
 
 The Daemon, or [Full-Node Client](../advanced/03-node.md), is the core process of a Cosmos SDK-based blockchain. Participants in the network run this process to initialize their state-machine, connect with other full-nodes, and update their state-machine as new blocks come in.
 
-```text
-                ^  +-------------------------------+  ^
-                |  |                               |  |
-                |  |  State-machine = Application  |  |
-                |  |                               |  |   Built with Cosmos SDK
-                |  |            ^      +           |  |
-                |  +----------- | ABCI | ----------+  v
-                |  |            +      v           |  ^
-                |  |                               |  |
-Blockchain Node |  |           Consensus           |  |
-                |  |                               |  |
-                |  +-------------------------------+  |   CometBFT
-                |  |                               |  |
-                |  |           Networking          |  |
-                |  |                               |  |
-                v  +-------------------------------+  v
+```mermaid
+flowchart TD
+    subgraph Blockchain_Node[Blockchain Node]
+        subgraph SM[State-machine = Application]
+            direction TB
+            SM1[Cosmos SDK]
+        end
+        subgraph ABCI[ABCI]
+            direction TB
+        end
+        subgraph Consensus[Consensus]
+            direction TB
+        end
+        subgraph Networking[Networking]
+            direction TB
+        end
+    end
+
+    SM <--> ABCI
+    ABCI <--> Consensus
+    Consensus <--> Networking
+
+    Blockchain_Node -->|Includes| SM
+    Blockchain_Node -->|Includes| Consensus
+    Blockchain_Node -->|Includes| Networking
 ```
 
 The blockchain full-node presents itself as a binary, generally suffixed by `-d` for "daemon" (e.g. `appd` for `app` or `gaiad` for `gaia`). This binary is built by running a simple [`main.go`](../advanced/03-node.md#main-function) function placed in `./cmd/appd/`. This operation usually happens through the [Makefile](#dependencies-and-makefile).
